app/controllers/api/notes_controller.rb

  def create
    @note = Note.new(note_params)
    if @note.save
---
INSERT INTO "notes" ("title", "notebook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "createNOTE"], ["notebook_id", 19], ["created_at", "2021-02-16 19:29:44.775944"], ["updated_at", "2021-02-16 19:29:44.775944"]]

  def update
    @note = current_user.notes.find_by(id: params[:id])
    if @note.update(note_params)
---
UPDATE "notes" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "notes"."id" = $4  [["title", "updateNote"], ["body", "hello"], ["updated_at", "2021-02-16 19:31:46.492370"], ["id", 16]]

  def destroy
    @note = current_user.notes.find_by(id: params[:id])
    if @note
      @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 17]]