app/controllers/api/notebooks_controller.rb

INSERT INTO "notebooks" ("notebook_name", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["notebook_name", "hello"], ["author_id", 23], ["created_at", "2021-02-12 18:09:51.950889"], ["updated_at", "2021-02-12 18:09:51.950889"]]
---
  def create
    @notebook = Notebook.new(notebook_params)
    if @notebook.save

UPDATE "notebooks" SET "notebook_name" = $1, "updated_at" = $2 WHERE "notebooks"."id" = $3  [["notebook_name", "bye"], ["updated_at", "2021-02-12 18:10:38.810345"], ["id", 4]]
---
  def update
    @notebook = current_user.notebooks.find_by(id: params[:id])
    if @notebook.update(notebook_params)

DELETE FROM "notebooks" WHERE "notebooks"."id" = $1  [["id", 4]]
---
  def destroy
    @notebook = current_user.notebooks.find_by(id: params[:id])
    @notebook.destroy

SELECT "notes"."id" FROM "notes" WHERE "notes"."notebook_id" = $1  [["notebook_id", 34]]
---
  def show
    @notebook = current_user.notebooks.find_by(id: params[:id])