app/views/api/notebooks/show.json.jbuilder

SELECT "notes"."id" FROM "notes" WHERE "notes"."notebook_id" = $1  [["notebook_id", 33]]
---
json.extract! @notebook, :id, :notebook_name, :author_id, :created_at, :updated_at
json.noteIds @notebook.notes.pluck(:id)