full_stack_project/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "nabxQ6-ZlKuLU1lo7b-3YA"], ["LIMIT", 1]]
---
  def current_user
    return nill unless session[:session_token]
    @current_user ||= User.find_by_session_token(session[:session_token])